#+TITLE: 队列
#+DATE: 2023-09-28 00:27:14
#+DISPLAY: t
#+STARTUP: indent
#+OPTIONS: toc:10
#+AUTHOR: inmove
#+SUBTITLE: 循环队列 优先队列
#+KEYWORDS: Queue
#+CATEGORIES: 数据结构

* PriorityQueue

#+NAME: PriorityQueue.py
#+begin_src python :results output
  class PriorityQueue:

      def __init__(self, size=None):
          if size is None:
              size = float('inf')
          # 容量
          self.size = size
          # 当前元素个数
          self.count = 0
          self.values = []

      def put(self, value):
          if self.count == self.size:
              self.values[self.size - 1] = value
          else:
              self.values.append(value)
              self.count += 1
          self.__bubbleUp(self.count - 1)

      def pop(self):
          if self.isEmpty():
              raise Exception("队空")
          result = self.values[0]
          self.values[0] = self.values[self.count - 1]
          self.count -= 1
          if self.count > 0:
              self.__bubbleDown(0)
          return result

      def __bubbleUp(self, start):
          while True:
              if start == 0:
                  break
              parent = self.__parent(start)
              pValue = self.values[parent]
              if self.values[start] > pValue:
                  break
              self.values[parent], self.values[start] = self.values[start], self.values[parent]
              start = parent

      def __bubbleDown(self, start):
          while True:
              if start == self.count - 1:
                  break
              lChild = self.__leftChild(start)
              rChild = self.__rightChild(start)
              value = self.values[start]

              lValue = float('inf')
              if lChild < self.count:
                  lValue = self.values[lChild]

              rValue = float('inf')
              if rChild < self.count:
                  rValue = self.values[rChild]

              if value < lValue and value < rValue:
                  break
              minIndex = start
              if lValue < self.values[minIndex]:
                  minIndex = lChild
              if rValue < self.values[minIndex]:
                  minIndex = rChild
              self.values[start], self.values[minIndex] = self.values[minIndex], self.values[start]
              start = minIndex

      def __leftChild(self, index):
          return index * 2 + 1

      def __rightChild(self, index):
          return self.__leftChild(index) + 1

      def __parent(self, index):
          return (index - 1) // 2

      def isEmpty(self):
          return self.count == 0

      def getValues(self):
          return self.values[:self.count]


  if __name__ == '__main__':
      priorityQueue = PriorityQueue(3)
      priorityQueue.put(3)
      priorityQueue.put(4)
      priorityQueue.put(5)
      priorityQueue.put(1)
      print(priorityQueue.values)
      while priorityQueue.count:
          print(priorityQueue.pop())
          print(priorityQueue.getValues())
#+end_src

#+RESULTS: PriorityQueue.py
: [1, 4, 3]
: 1
: [3, 4]
: 3
: [4]
: 4
: []
